In [ ]:
import numpy as np
import pandas as pd
pd.set_option("display.precision", 2)

In [ ]:
df = pd.read_csv(filepath_or_buffer='adult_data.csv')

In [ ]:
df.head()

   age         workclass  fnlwgt  ... hours-per-week  native-country salary
0   39         State-gov   77516  ...             40   United-States  <=50K
1   50  Self-emp-not-inc   83311  ...             13   United-States  <=50K
2   38           Private  215646  ...             40   United-States  <=50K
3   53           Private  234721  ...             40   United-States  <=50K
4   28           Private  338409  ...             40            Cuba  <=50K

[5 rows x 15 columns]

1. How many men and women (sex feature) are represented in this dataset?

In [ ]:
df['sex'].value_counts()

Male      21790
Female    10771
Name: sex, dtype: int64

2. What is the average age (age feature) of women?

In [ ]:
df[df['sex'] == 'Female']['age'].mean()

36.85823043357163

3. What is the percentage of German citizens (native-country feature)?

In [ ]:
len(df[df['native-country'] == 'Germany']) / len(df) * 100

0.42074874850281013

4-5. What are the mean and standard deviation of age for those who earn more than 50K per year (salary feature) and those who earn less than 50K per year?

In [ ]:
age1 = df[df['salary'] == '<=50K']['age']
age2 = df[df['salary'] == '>50K']['age']

print('The average age of the <=50K: {0}, std: {1}\nThe average age of the >50K: {2}, {3}' . format(age1.mean(), age1.std(), age2.mean(), age2.std()))

The average age of the <=50K: 36.78373786407767, std: 14.020088490824813
The average age of the >50K: 44.24984058155847, 10.51902771985177

6. Is it true that people who earn more than 50K have at least high school education? (education – Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters or Doctorate feature)

In [ ]:
df.loc[df['salary'] == '>50K', 'education'].value_counts() #or just .unique()

Bachelors       2221
HS-grad         1675
Some-college    1387
Masters          959
Prof-school      423
Assoc-voc        361
Doctorate        306
Assoc-acdm       265
10th              62
11th              60
7th-8th           40
12th              33
9th               27
5th-6th           16
1st-4th            6
Name: education, dtype: int64

7. Display age statistics for each race (race feature) and each gender (sex feature). Use groupby() and describe(). Find the maximum age of men of Amer-Indian-Eskimo race.

In [ ]:
df.groupby(['race', 'sex'])['age'].describe()

                             count   mean    std   min   25%   50%    75%   max
race               sex
Amer-Indian-Eskimo Female    119.0  37.12  13.11  17.0  27.0  36.0  46.00  80.0
                   Male      192.0  37.21  12.05  17.0  28.0  35.0  45.00  82.0
Asian-Pac-Islander Female    346.0  35.09  12.30  17.0  25.0  33.0  43.75  75.0
                   Male      693.0  39.07  12.88  18.0  29.0  37.0  46.00  90.0
Black              Female   1555.0  37.85  12.64  17.0  28.0  37.0  46.00  90.0
                   Male     1569.0  37.68  12.88  17.0  27.0  36.0  46.00  90.0
Other              Female    109.0  31.68  11.63  17.0  23.0  29.0  39.00  74.0
                   Male      162.0  34.65  11.36  17.0  26.0  32.0  42.00  77.0
White              Female   8642.0  36.81  14.33  17.0  25.0  35.0  46.00  90.0
                   Male    19174.0  39.65  13.44  17.0  29.0  38.0  49.00  90.0

8. Among whom is the proportion of those who earn a lot (>50K) greater: married or single men (marital-status feature)? Consider as married those who have a marital-status starting with Married (Married-civ-spouse, Married-spouse-absent or Married-AF-spouse), the rest are considered bachelors.

In [ ]:
df.loc[(df['sex'] == 'Male') &
     (df['marital-status'].isin(['Never-married', 'Separated', 'Divorced', 'Widowed'])), 'salary'].value_counts()

<=50K    7552
>50K      697
Name: salary, dtype: int64

In [ ]:
df.loc[(df['sex'] == 'Male') &
     (df['marital-status'].str.startswith('Married')), 'salary'].value_counts()

<=50K    7576
>50K     5965
Name: salary, dtype: int64

9. What is the maximum number of hours a person works per week (hours-per-week feature)? How many people work such a number of hours, and what is the percentage of those who earn a lot (>50K) among them?

In [ ]:
max_hours = df['hours-per-week'].max()
print('max hours:', max_hours)

workers_max_hours = df.loc[df['hours-per-week'] == max_hours].shape[0]
print('number of people who work max hours:', workers_max_hours)

perc_rich = df.loc[(df['hours-per-week'] == max_hours) & (df['salary'] == '>50K')].shape[0] / workers_max_hours * 100
print('percentage of those who earn more 50K: {0}%'.format(round(perc_rich, 2)))

max hours: 99
number of people who work max hours: 44
percentage of those who earn more 50K: 27.27%

10. Count the average time of work (hours-per-week) those who earning a little and a lot (salary) for each country (native-country).

In [ ]:
sub_df = df.loc[(df['salary'] != '<=') & (df['native-country'] != '?')]

pd.crosstab(sub_df['native-country'], sub_df['salary'], values=sub_df['hours-per-week'], aggfunc=np.mean)

salary                      <=50K   >50K
native-country
Cambodia                    41.89  40.00
Canada                      36.79  47.07
China                       37.08  40.00
Columbia                    39.66  50.00
Cuba                        37.74  35.23
Dominican-Republic          41.20  47.00
Ecuador                     36.29  50.00
El-Salvador                 36.35  45.00
England                     40.85  41.52
France                      45.22  61.00
Germany                     38.31  45.04
Greece                      45.60  48.75
Guatemala                   38.83  40.00
Haiti                       34.85  40.00
Honduras                    31.00  60.00
Hong                        37.83  52.50
Hungary                     30.50  40.00
India                       39.68  44.10
Iran                        42.26  47.92
Ireland                     39.83  50.00
Italy                       37.04  44.37
Jamaica                     40.00  42.57
Japan                       40.92  46.15
Laos                        40.00    NaN
Mexico                      39.80  48.27
Nicaragua                   34.94  37.50
Outlying-US(Guam-USVI-etc)  43.14    NaN
Peru                        34.25  40.00
Philippines                 38.86  42.63
Poland                      39.97  38.67
Portugal                    39.58  42.00
Puerto-Rico                 38.46  39.12
Scotland                    36.67    NaN
South                       41.77  51.79
Taiwan                      39.67  47.73
Thailand                    50.14  62.50
Trinadad&Tobago             35.57  40.00
United-States               38.83  45.30
Vietnam                     38.38  40.00
Yugoslavia                  42.00  40.00